УТ_для_edt/src/BusinessProcesses/смартIECHOПродажа/смартIECHOПродажа.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:BusinessProcess>
  <name>смартIECHOПродажа</name>
  <comment>//смарт:ММ #092 389 17.01.2021</comment>
  <task>Task.ЗадачаИсполнителя</task>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Предмет</name>
    <type>
      <types>DocumentRef.смартIECHOСпецификация</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗавершения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Наименование</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КлиентСогласился</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КлиентОтказалсяОтЗаказаНаЭтапеОплаты</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаказКлиента</name>
    <type>
      <types>DocumentRef.ЗаказКлиента</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаказПоставщику</name>
    <type>
      <types>DocumentRef.ЗаказПоставщику</types>
    </type>
  </attributes>
</mdclass:BusinessProcess>

УТ_для_edt/src/BusinessProcesses/смартIECHOПродажа/Forms/ФормаЗадачи/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	НачальныйПризнакВыполнения = Объект.Выполнена;
	
	ПрочитатьРеквизитыИзБизнесПроцесса();
	
	Элементы.ДатаИсполнения.Формат = "ДЛФ=D";

	НастроитьВидимостьДоступность();
	
КонецПроцедуры

// ++ 23.01.2021
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	//МассивТочекМаршрутаЗадачВыполняющихсяПрограммно = ПолучитьМассивТочекМаршрутаЗадачВыполняющихсяПрограммно();
	//
	//Если МассивТочекМаршрутаЗадачВыполняющихсяПрограммно.Найти(Объект.ТочкаМаршрута) <> Неопределено Тогда		
		ПодключитьОбработчикОжидания("ПроверкаИзмененийПоЗадаче", 2);
	//КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПрочитатьРеквизитыИзБизнесПроцесса()
	
	БП = Объект.БизнесПроцесс;
	КлиентСогласился = БП.КлиентСогласился;
	КлиентОтказалсяОтЗаказаНаЭтапеОплаты = БП.КлиентОтказалсяОтЗаказаНаЭтапеОплаты;
	Номенклатура 	= БП.Номенклатура;
	ЗаказКлиента 	= БП.ЗаказКлиента;
	ЗаказПоставщику = БП.ЗаказПоставщику;

КонецПроцедуры

// ++ 23.01.2021
&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Форма = ЭтаФорма;
	
	Если ИмяСобытия = "смартЗапись_ЗадачаИсполнителяIECHO" 
		И НЕ Форма.Модифицированность 
		//И (Источник = Форма.Объект.Ссылка ИЛИ (ТипЗнч(Источник) = Тип("Массив") 
		//И Источник.Найти(Форма.Объект.Ссылка) <> Неопределено)) 
		Тогда
		
		Форма.Прочитать();
		ПрочитатьРеквизитыИзБизнесПроцесса();
			
	КонецЕсли;
	
КонецПроцедуры


#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаписатьИЗакрытьВыполнить()

	ЗаписатьБизнесПроцессНаСервере();
	
	// Просто запись, без выполнения
	БизнесПроцессыИЗадачиКлиент.ЗаписатьИЗакрытьВыполнить(ЭтаФорма);

КонецПроцедуры

&НаСервере
Функция ЗадачуМожноЗакрыть()
	
	Об = РеквизитФормыВЗначение("Объект");
	Возврат Об.ПроверитьВыполнение();
	
КонецФункции

&НаКлиенте
Процедура ВыполненоВыполнить()
	
	ЗаписатьБизнесПроцессНаСервере();
	
	Если Объект.Выполнена Тогда	
		Закрыть();
	КонецЕсли;
	
	ПроверкаПройдена = ЗадачуМожноЗакрыть();
	
	Если ПроверкаПройдена Тогда
		БизнесПроцессыИЗадачиКлиент.ЗаписатьИЗакрытьВыполнить(ЭтаФорма, Истина);
	Иначе
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не все условия задачи выполнены!");
	КонецЕсли;

	Оповестить("смартЗапись_ЗадачаИсполнителяIECHO");
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьБизнесПроцессНаСервере()
	
	
	БПСсылка = Объект.БизнесПроцесс;
	
	Если БПСсылка.КлиентСогласился <> КлиентСогласился
		ИЛИ БПСсылка.КлиентОтказалсяОтЗаказаНаЭтапеОплаты <> КлиентОтказалсяОтЗаказаНаЭтапеОплаты
		ИЛИ БПСсылка.Номенклатура <> Номенклатура
		ИЛИ БПСсылка.ЗаказКлиента <> ЗаказКлиента
		ИЛИ БПСсылка.ЗаказПоставщику <> ЗаказПоставщику
		Тогда
		
		БП = БПСсылка.ПолучитьОбъект();
		БП.КлиентСогласился = КлиентСогласился;
		БП.КлиентОтказалсяОтЗаказаНаЭтапеОплаты = КлиентОтказалсяОтЗаказаНаЭтапеОплаты;
		БП.Номенклатура 	= Номенклатура;
		БП.ЗаказКлиента 	= ЗаказКлиента;
		БП.ЗаказПоставщику 	= ЗаказПоставщику;
		
		БП.Записать();
	КонецЕсли;
	
КонецПроцедуры


#КонецОбласти

&НаСервере
Процедура НастроитьВидимостьДоступность()
	
	Элементы.ЗаданиеКлиентСогласился.Видимость = Ложь;
	Элементы.ЗаданиеКлиентСогласился.ТолькоПросмотр = Истина;
	
	Элементы.ЗаданиеНоменклатура.ТолькоПросмотр = Истина;
	Элементы.ЗаданиеНоменклатура.Видимость = Ложь;
	
	Элементы.ЗаданиеКлиентОтказалсяОтЗаказаНаЭтапеОплаты.Видимость = Ложь;
	Элементы.ЗаданиеКлиентОтказалсяОтЗаказаНаЭтапеОплаты.ТолькоПросмотр = Истина;
	
	Элементы.ЗаданиеЗаказКлиента.Видимость = Ложь;
	Элементы.ЗаданиеЗаказКлиента.ТолькоПросмотр = Истина;
	
	Элементы.ЗаданиеЗаказПоставщику.Видимость = Ложь;
	Элементы.ЗаданиеЗаказПоставщику.ТолькоПросмотр = Истина;
	
	Если Объект.ТочкаМаршрута = БизнесПроцессы.смартIECHOПродажа.ТочкиМаршрута.СогласоватьСКлиентом Тогда  // 1
		Элементы.ЗаданиеКлиентСогласился.Видимость = Истина;
		Элементы.ЗаданиеКлиентСогласился.ТолькоПросмотр = Ложь;
	ИначеЕсли Объект.ТочкаМаршрута = БизнесПроцессы.смартIECHOПродажа.ТочкиМаршрута.СоздатьНоменклатуруПоСпецификации Тогда  // 3
		Элементы.ЗаданиеНоменклатура.ТолькоПросмотр = Ложь;
		Элементы.ЗаданиеНоменклатура.Видимость = Истина;
	ИначеЕсли Объект.ТочкаМаршрута = БизнесПроцессы.смартIECHOПродажа.ТочкиМаршрута.СоздатьЗаказ Тогда  // 4
		Элементы.ЗаданиеНоменклатура.Видимость = Истина;
		Элементы.ЗаданиеЗаказКлиента.Видимость = Истина;
		Элементы.ЗаданиеЗаказКлиента.ТолькоПросмотр = Ложь;
	ИначеЕсли Объект.ТочкаМаршрута = БизнесПроцессы.смартIECHOПродажа.ТочкиМаршрута.ОжиданиеОплатыОтКлиента Тогда // 5
		Элементы.ЗаданиеНоменклатура.Видимость = Истина;
		Элементы.ЗаданиеКлиентОтказалсяОтЗаказаНаЭтапеОплаты.Видимость = Истина;
		Элементы.ЗаданиеКлиентОтказалсяОтЗаказаНаЭтапеОплаты.ТолькоПросмотр = Ложь;
		Элементы.ЗаданиеЗаказКлиента.Видимость = Истина;
	ИначеЕсли Объект.ТочкаМаршрута = БизнесПроцессы.смартIECHOПродажа.ТочкиМаршрута.ОтменитьЗаказ Тогда // 6
		Элементы.ЗаданиеНоменклатура.Видимость = Истина;
		Элементы.ЗаданиеКлиентОтказалсяОтЗаказаНаЭтапеОплаты.Видимость = Истина;
		Элементы.ЗаданиеЗаказКлиента.Видимость = Истина;
		Элементы.ЗаданиеЗаказКлиента.ТолькоПросмотр = Ложь;
	ИначеЕсли Объект.ТочкаМаршрута = БизнесПроцессы.смартIECHOПродажа.ТочкиМаршрута.СоздатьЗаказПоставщику Тогда // 7
		Элементы.ЗаданиеНоменклатура.Видимость = Истина;
		Элементы.ЗаданиеКлиентОтказалсяОтЗаказаНаЭтапеОплаты.Видимость = Истина;
		Элементы.ЗаданиеЗаказКлиента.Видимость = Истина;
		Элементы.ЗаданиеЗаказПоставщику.Видимость = Истина;
		Элементы.ЗаданиеЗаказПоставщику.ТолькоПросмотр = Ложь;
	КонецЕсли;	
	
КонецПроцедуры

// ++ 23.01.2021
&НаСервереБезКонтекста
Функция ПолучитьМассивТочекМаршрутаЗадачВыполняющихсяПрограммно()
	
	Результат = Новый Массив;
	Результат.Добавить(БизнесПроцессы.смартIECHOПродажа.ТочкиМаршрута.ПометитьСпецификациюНаУдаление);
	//Результат.Добавить(БизнесПроцессы.смартIECHOПродажа.ТочкиМаршрута.СоздатьНоменклатуруПоСпецификации);
	Результат.Добавить(БизнесПроцессы.смартIECHOПродажа.ТочкиМаршрута.СоздатьЗаказ);
	Результат.Добавить(БизнесПроцессы.смартIECHOПродажа.ТочкиМаршрута.ОжиданиеОплатыОтКлиента);
	Результат.Добавить(БизнесПроцессы.смартIECHOПродажа.ТочкиМаршрута.ОтменитьЗаказ);
	
	Возврат Результат;
	
КонецФункции

// ++ 23.01.2021
&НаКлиенте
Процедура ПроверкаИзмененийПоЗадаче()
	
	ЕстьМодификации = ПроверитьИзмененияПоЗадачеНаСервере();
	
	Если ЕстьМодификации И НЕ ЭтаФорма.Модифицированность Тогда
		ЭтаФорма.Прочитать();
		ПрочитатьРеквизитыИзБизнесПроцесса();
	КонецЕсли;
	
КонецПроцедуры

// ++ 23.01.2021
&НаСервере
Функция ПроверитьИзмененияПоЗадачеНаСервере()
	
	Результат = Ложь;
	
	ТочкаМаршрута = Объект.ТочкаМаршрута;
	
	Если ТочкаМаршрута = БизнесПроцессы.смартIECHOПродажа.ТочкиМаршрута.ПометитьСпецификациюНаУдаление Тогда
		Если Объект.Предмет.ПометкаУдаления Тогда
			Результат = Истина;
		КонецЕсли;
	//ИначеЕсли ТочкаМаршрута = БизнесПроцессы.смартIECHOПродажа.ТочкиМаршрута.СоздатьЗаказ Тогда
	//	Если ЗначениеЗаполнено(Объект.БизнесПроцесс.ЗаказКлиента) Тогда
	//		Результат = Истина;
	//	КонецЕсли;
	//ИначеЕсли ТочкаМаршрута = БизнесПроцессы.смартIECHOПродажа.ТочкиМаршрута.ОжиданиеОплатыОтКлиента Тогда
	//	Результат = Истина;
	ИначеЕсли ТочкаМаршрута = БизнесПроцессы.смартIECHOПродажа.ТочкиМаршрута.ОтменитьЗаказ Тогда
		Если ЗначениеЗаполнено(Объект.БизнесПроцесс.ЗаказКлиента) И Объект.БизнесПроцесс.ЗаказКлиента.ПометкаУдаления 
			ИЛИ ЗаказКлиента <> Объект.БизнесПроцесс.ЗаказКлиента Тогда
			Результат = Истина;
		КонецЕсли;
	Иначе 
		БП = Объект.БизнесПроцесс;
		Если Номенклатура <> БП.Номенклатура
		ИЛИ КлиентСогласился <> БП.КлиентСогласился
		ИЛИ КлиентОтказалсяОтЗаказаНаЭтапеОплаты <> БП.КлиентОтказалсяОтЗаказаНаЭтапеОплаты
		ИЛИ ЗаказКлиента <> БП.ЗаказКлиента
		ИЛИ ЗаказПоставщику <> БП.ЗаказПоставщику
		ИЛИ Объект.ДатаИсполнения <> Объект.Ссылка.ДатаИсполнения Тогда
		Результат = Истина;
	КонецЕсли;

	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// ++ 23.01.2021
&НаКлиенте
Процедура ЗаданиеКлиентСогласилсяПриИзменении(Элемент)
	ЭтаФорма.Модифицированность = Истина;
КонецПроцедуры

// ++ 23.01.2021
&НаКлиенте
Процедура ЗаданиеНоменклатураПриИзменении(Элемент)
	ЭтаФорма.Модифицированность = Истина;
КонецПроцедуры

// ++ 23.01.2021
&НаКлиенте
Процедура ЗаданиеКлиентОтказалсяОтЗаказаНаЭтапеОплатыПриИзменении(Элемент)
	ЭтаФорма.Модифицированность = Истина;
КонецПроцедуры

// ++ 23.01.2021
&НаКлиенте
Процедура ЗаданиеЗаказКлиентаПриИзменении(Элемент)
	ЭтаФорма.Модифицированность = Истина;
КонецПроцедуры

// ++ 23.01.2021
&НаКлиенте
Процедура ЗаданиеЗаказПоставщикуПриИзменении(Элемент)
	ЭтаФорма.Модифицированность = Истина;
КонецПроцедуры
